import { Category } from './src/models/category';
import Meal from './src/models/meal';
import Article from './src/models/article';
import TipTitem from './src/models/tipItem';

export const CATEGORIES = [
	new Category('c1', 'מתכונים לבוקר', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_bnnh_tpvkh_vshybvlt_shvl.webp?itok=2HnBvYLF'),
	new Category('c2', 'מתכונים לצהריים', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_vp_m_yrqvt_vtryvt.webp?itok=GLsxSVvl'),
	new Category('c3', 'מתכונים לערב', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qrt_dyyst_dgnym.webp?itok=abfxDz3Q'),
	new Category('c4', ' כל המתכונים ', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qrt_dyyst_dgnym.webp?itok=abfxDz3Q'),
];


export const MEALS = [
	new Meal(
		'm1',
		['c1', 'c3', 'c4'],
		' יוגורט עם בננה, תפוח ושיבולת שועל',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_bnnh_tpvkh_vshybvlt_shvl.webp?itok=2HnBvYLF',

		10,
		[
			'יוגורט 1',
			'1 בננה',
			'1 תפוח',
			'שיבולת שועל',
			'סילאן',

		],
		[
			'חותכים את הבננה והתפוח לחתיכות, מכניסים לקערית עם יוגורט',
			'מוסיפים מעט פתיתי שיבולת שועל ומערבבים. יוצקים מעל סילאן [לא חובה] ומגישים',
		],
		false,
		false,
		[false, true, false, true]
	),

	new Meal(
		'm2',
		['c1', 'c3', 'c4'],
		'פרנץ טוסט',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/prnts_tvst.webp?itok=JQT9oDKP',
		15,
		[
			'1 פרוסת חלה',
			'ביצה',
			'מעט חלב',
			'שמן לטיגון'
		],
		[
			'טורפים ביצה עם מעט חלב',
			'טובלים את הפרוסה  משני הצדדים בבלילה ומניחים במחבת שחומם מראש עם מעט שמן',
			'ממתינים  כ-2 דקות או עד שמשחים והופכים לצד השני',
			'ניתן להגיש לצד גבינה לבנה ופירות חתוכים'
		],
		false,
		false,
		[false, true, false, false]
	),

	new Meal(
		'm3',
		['c1', 'c4'],
		'פנקייק תפוח עץ מוגש עם גבינה לבנה וממרח חמאת בוטנים',
		'קל-בינוני',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/pnqyyq_tpvkhym.webp?itok=KnFkmIaP',
		20,
		[
			'1/2 כוס קמח לבן',
			'1/2 כוס קמח מלא',
			'1 צנצנת מחית תפוחי עץ  גרבר',
			'1 כוס חלב',
			'2 ביצים'
		],
		[
			'מערבבים את החומרים היטב עד לקבלת בלילה אחידה',
			'מחממים מחבת טפלון ומשמנים קלות במעט שמן',
			'בעזרת מצקת יוצקים מהבלילה למחבת החמה, הופכים לאחר כדקה עד שתיים עד לקבלת פנקייקס זהובים',
			'ניתן להגיש לצד כף גבינה לבנה וכף חמאת בוטנים',
			'פנקייק היא דרך נהדרת לשלב חלבון וסידן בתפריט'
		],
		false,
		false,
		[false, true, false, false]
	),
	new Meal(
		'm4',
		['c2', 'c4'],
		'מרק ירקות, קוסקוס ועוף',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_yrqvt_qvsqvs_vvp.webp?itok=94PoOm6E',
		60,
		[
			'קוסקוס',
			'1 בצל',
			'1 גזר',
			'1 תפוח אדמה',
			'1 דלעת',
			'גבעולי סלרי',
			'פטרוזילה',
			'שמיר',
			' כרעיים עוף מחולק',
			'4 כוסות מים',
			'תבלינים כגון כורכום ופלפל שחור',
		],
		[
			' מכינים את הקוסקוס לפי הוראות היצרן. חותכים את הירקות לקוביות',
			'מכניסים את כל החומרים לסיר ומביאים להרתחה',
			'מעבירים לאש נמוכה לעוד כשעה',
			'מוסיפים תבלינים לפי הטעם',
			'מוסיפים למרק את הקוסקוס, בתאבון!',
			'ותרו על המלח ואבקות המרק, השתמשו בעשבי תיבול טבעיים כמו סלרי, פטרוזיליה, כוסברה ושום.'

		],
		false,
		false,
		[false, true, true, true]
	),


	new Meal(
		'm5',
		['c2', 'c4'],
		'מרק אפונה',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_pvnh.webp?itok=SFzASqEK',
		45,
		[
			'1 בצל',
			'1 גזר',
			'1 תפוח אדמה',
			' 1 קישוא',
			'1 כוס אפונה ירוקה קפואה',
			' 1 שוק הודו נקבה(ללא עור)',
			' או 200 גרם שווארמה הודו חתוכה לקוביות',
			'4 כוסות מים',
			'  עשבי תיבול - סלרי, פטרוזילה, כוסברה',
		],
		[
			'מחממים את השמן בסיר, קוצצים את הבצל ומשחימים',
			'מוסיפים את הבשר ומערבבים היטב',
			'מוסיפים את הירקות, האפונה ועשבי התיבול  למים ומביאים לרתיחה',
			'מבשלים על להבה בינונית במשך ½ שעה',
			'במידה ושמים שוק הודו, מפרקים מהעצמות וטוחנים למרקם חלק',
			'ניתן לשלב עשבי תיבול, בצל ושום להעשרת הטעם',
			'בהמשך ניתן לשלב תבלינים כמו כורכום, פפריקה, כמון',
			'מומלץ לוותר על מלח ואבקות מרק',
		],
		false,
		false,
		[false, true, false, true]
	),
	new Meal(
		'm6',
		['c3', 'c4'],
		'מאפינס תירס ירקות חתוכים וקוטג',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mpyns_tyrs.webp?itok=3zdJJDjX',
		50,
		[
			'חצי קופסת תירס',
			"2 גזרים",
			'1 ביצה',
			'1 כף גדושה קמח תופח',
			'פרמזן מגורד (לפי הטעם)',
			' פלפל',
			' תבנית מאפינס מסיליקון',
			'קוטג',
			'גמבה עגבניה ומלפפונים חתוכים',
		],
		[
			'מגרדים את הירקות בפומפייה ומערבבים בקערה את כל החומרים',
			'יוצקים לתבנית את התערובת לתבנית שקעים אך לא עד הקצה',
			'כניסים לתנור שחומם מראש ל 180 מעלות ואופים 40-30 דקות',
			'מגישים עם ירקות חתוכים וקוטג',
		],
		false,
		false,
		[false, true, false, false]
	),
	new Meal(
		'm7',
		['c3', 'c4'],
		'לביבות ירק שילדים אוהבים',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/lbybvt_yrq_m_shmnt_vbvqdv.webp?itok=fz3IohzK',
		30,
		[
			'1 גזר',
			" 1 קישוא",
			'1 תפוח אדמה',
			'3 כפות קמח',
			'2 ביצים',
			' פלפל',
		],
		[
			' מגרדים בפומפייה את הירקות',
			'מערבבים את כל החומרים ומטגנים במחבת עם מעט שמן',
			'ניתן להגיש שמנת חמוצה ואבוקדו',
			'בתאבון!',
		],
		false,
		true,
		[false, true, true, false]
	),

	new Meal(
		'm8',
		['c2', 'c4'],
		'קציצות בקר עם אפונת גינה',
		'קל-בינוני',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qtsytsvt_m_pvnh.webp?itok=U3Nb1owh',
		35,
		[
			'לתערובת הקציצות:',
			'1/2 ק"ג בשר בקר טחון',
			"1 גזר מגורר",
			'1 קישוא מגורר',
			'1 תפוח אדמה מגורר',
			' בצל מגורר 1 ',
			'צרור פטרוזיליה',
			'1 כף שמן זית',
			'2 כפות פירורי לחם',
			'1 ביצה',
			'קורט פלפל שחור',
			'',
			'לרוטב:',
			'כף שמן זית',
			'חבילת אפונת גינה מוקפאת',
			'כורכום'
		],
		[
			'לקציצות:',
			'מערבבים את כל החומרים בקערה ויוצרים קציצות',
			'שמים במחבת רחבה עם מכסה מעט שמן זית מוסיפים כורכום וכוס מים ומביאים לרתיחה',
			'מכניסים את הקציצות לרוטב ומוסיפים את אפונת הגינה לאחר כרבע שעה',
			'מבשלים  כ-10 דקות נוספות על אש קטנה. להגיש לצד אורז'
		],
		false,
		false,
		[false, true, true, false]
	),
	new Meal(
		'm9',
		['c2', 'c4'],
		'מרק עוף עם ירקות ואטריות',
		'קל-בינוני',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_vp_m_yrqvt_vtryvt.webp?itok=GLsxSVvl',
		35,
		[
			' קוסקוס או אטריות',
			'1 גזר',
			'1 תפו"א',
			' גבעולי סלרי',
			'1 בצל',
			'1 דלעת ',
			'כרעיים עוף מחולק',
			'פטרוזיליה',
			'שמיר',
			'4 כוסות מים'
		],
		[
			'מכינים בנפרד את הקוסקוס או האיטריות לפי הוראות היצרן ',
			'חותכים את הירקות לקוביות',
			'כניסים את כל החומרים לסיר ומביאים להרתחה. מעבירים לאש נמוכה לעוד כשעה',
			'להוסיף את האטריות או הקוסקוס למרק המוכן. מוסיפים תבלינים לפי הצורך',
			'הקפידו על ארוחות משפחתיות גם במהלך ימות השבוע כדי להקנות הרגלי תזונה בריאים',

		],
		false,
		false,
		[false, true, true, true]
	),
	new Meal(
		'm10',
		['c2', 'c4'],
		'מרק כתום',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_ktvm_0.webp?itok=z3jb7LtZ',
		45,
		[
			'1 בצל בינוני',
			'1 שן שום כתושה(לא חובה)',
			'3 גזרים',
			'1 בטטה',
			' כוס עדשים כתומות',
			' 6 כוסות מים',
		],
		[
			'מחממים מעט שמן זית בסיר גדול ומטגנים את הבצל עד שהוא מזהיב',
			'מוסיפים את השום ומטגנים עוד דקה',
			'מוסיפים את הבטטה והגזרים ומאדים 5-10 דקות תוך כדי ערבוב',
			'מוסיפים את העדשים והמים ומביאים לרתיחה',

			'מנמיכים את הלהבה ומבשלים בבעבוע עדין כ-30 דקות, עד שהעדשים מתפוררות והגזר והבטטה רכים לחלוטין',
			'טוחנים את המרק למרקם חלק ואחיד',
		],
		true,
		true,
		[true, true, true, true]
	),
	new Meal(
		'm11',
		['c1', 'c4'],
		'יוגורט עם פירות וממרח שקדים טבעי ',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_m_pyrvt_vmmrkh_shqdym_tby.webp?itok=5KLfZU3u',
		10,
		[
			'יוגורט לא ממותק',
			'בננה',
			'תפוח',
			'ממרח שקדים טבעי'
		],
		[
			'מרסקים את התפוח המקולף בפומפיה גסה',
			'חותכים בננה לקוביות קטנות מוסיפים לקערה עם יוגורט וכפית ממרח שקדים ומערבבים',
			'יוגורט הוא מקור טוב לחלבון, ויטמינים מקבוצה B, עשיר בסידן ובפרוביוטיקה (חיידקים ידידותיים למערכת העיכול).'
		],
		false,
		false,
		[true, true, false, true]
	),

	new Meal(
		'm12',
		['c1', 'c4'],
		'מחית אגס, בננה, סלק וממרח שקדים טבעי',
		'קל',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mkhyt_gs_bnnh_slq.webp?itok=Ffgkr7sz',
		10,
		[
			'אגס',
			'בננה',
			' קוביית סלק לאחר אידוי',
			' כפית ממרח שקדים טבעי'
		],
		[
			'חותכים  ומרסקים את החומרים בבלנדר ובתיאבון!',
			'הסלק הוא מקור מעולה לברזל ולויטמין C הידועים כחיוניים לתפקוד תקין של גופנו. '
		],
		true,
		true,
		[true, true, true, true]
	),


]

export const ARTICLES = [
	new Article(
		'a1',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/lomdim-lechol_a_725x418.webp?itok=7QqZU8vV',
		'לומדים לאכול – השלב הבא',
		'כיצד נכון ללמד את התינוק לאכול מכפית, מדוע זמן איכות והאכלה קשובה חשובים כל כך ומהם הסימנים שמגלים לנו שהתינוק שלנו כבר שבע?',
		' מיומנות אכילה בכפית כשלומדים לאכול, יוצאים לדרך מפותלת ומלאה במזון המקשט את בגדיו של התינוק – ולעתים גם את שלך. שרירי הפה של תינוקך מתחזקים, הוא מפתח תיאום יד-פה ומודעותו למתרחש בזמן הארוחה גוברת. בקרוב, ועם מעט עזרה, הוא יאכל לבד.אבל לפני כן, עליו ללמוד כיצד להעביר את האוכל בהצלחה מהכפית אל הפה. עבור תינוקך, ארוחות הן פעילות מהנה והוא ירצה להיות חלק מהחוויה כשיראה אותך אוכלת. ברגע שהקטן יבין מהי כפית, הוא יפתח את הפה כשיראה אותה. יכול להיות שירצה להחזיק אותה, לשחק בה או להכניס אותה לפה – וזה מצוין. התעסקות עם הכפית בכל צורה שהיא תסייע לתינוקך כשיגדל ותלמד אותו להשתמש בכלים נוספים כמו צבעים, עפרונות ומספריים.התינוק יתחיל לזהות מאכלים ואף את כלי האוכל שלו, ולכן כדאי למצוא שגרה שתתאים לשניכם ותקל על ההסתגלות לדברים החדשים.'
	),
	new Article(
		'a2',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/1000x320.webp?itok=IG1hYr9D',
		' פרוביוטיקה: החיידקים הטובים של המעי',
		'למה פרוביוטיקה חשובה בתזונת תינוקות?',
		'פרוביוטיקה - אשר פירושה המילולי הוא "עבור החיים" – הוא מונח המתייחס לאוכלוסיית חיידקים חיים אשר הינם בעלי יתרונות בריאותיים ספציפיים לגוף האדם, כאשר נצרכים בכמות מתאימה 99% מן החיידקים הנמצאים במעי הם למעשה בלתי מזיקים וחיוניים לבריאות. ועדיין, למרות שהם מהווים רוב מוחץ כל כך, חיידקים טובים אלה זקוקים לעתים למעט עזרה כדי לשמור על האיזון הנכון ולמנוע נזק של החיידקים הפתוגנים – מחוללי המחלות, המהווים 1%. מה היתרונות של פרוביוטיקה לילדים? פרט לתמיכה בבריאות הכוללת והגנה חיסונית, פרוביוטיקה כגון L.reuteri הוכחה באופן קליני כבעלת תועלות במערכת העיכול של תינוקות וילדים'

	),
	new Article(
		'a3',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/tzmvn.webp?itok=wUE9Gk_b',
		' מתי כדאי להציע לתינוק חיטה, ביצים או אגוזים?',
		'כדאי לדעת! הזמן לחשוף את התינוק לחיטה, ביצים, דגים ובוטנים אינה שונה מהזמן שבו תכננתם לחשוף לשאר המ זונות. חשיפה של התינוק למאכלים אלו מוקדם, החל מגיל חצי שנה, עשויה להפחית את הסיכון לאלרגיה למזונות אלו החשודים כאלרגנים.',
		'אלרגיה למזון, שכיחה יותר בילדים, מאשר במבוגרים. שכיחות האלרגיה למזון בקרב תינוקות וילדים מוערכת ב-%8%-2. במשך שנים רבות, ההמלצה היתה לדחות חשיפה למזונות המזוהים בדרך כלל כאלרגניים (כמו: סויה, חיטה, ביצים, דגים, אגוזים, רכיכות, מוצרי חלב ובוטנים). לגבי חלק מהמזונות, ההמלצה היתה לחכות אפילו לגיל שנתיים או שלוש. עם זאת, מחקרים מהשנים האחרונות מצאו שדחיית זמן החשיפה של מזונות אלו, לא הוכחה כיעילה בהפחתת אלרגיה אצל תינוקות. בשנים האחרונות, ההמלצות השתנו ומדענים גילו, שכאשר התינוק בריא ובשל מבחינה התפתחותית, אין כל סיבה להמתין כדי להציע לו את המאכלים האלו, בזמן המעבר למזון משלים. מחקרים מראים, שדחיית מתן מזונות אלרגניים לתינוקות, מעבר לגיל 6-10 חודשים, עלולה אף להעלות את הסיכון לאלרגיה למזון. מחקרים אלו הציעו, שחשיפת תינוקות למזונות אלו מוקדם יחסית, באופן קבוע ובמנות קטנות, עשויה לתרום לסבילות של מערכת החיסון, כלפי חלק מהמזונות ועשויה למנוע אלרגיה למזון. אם לתינוקכם יש אקזמה, היסטוריה משפחתית של אלרגיה או כל מקרה ספציפי של אלרגיה למזון, התייעצו עם הרופא/ה המטפל/ת לפני שאתם חושפים אותו למזון שעלול לעורר תגובה אלרגית. הציעו לקטנטן שלכם טעימה ראשונה מאחד מהמזונות הללו ואז המתינו יומיים. חשוב לבודד את המזון האלרגני, כדי שניתן יהיה לבדוק האם נוצרה תגובה אלרגית כלשהי. לאחר שתוודאו שלא נוצרה תגובה אלרגית, תוכלו להציע טעימה ממזון אלרגני אחר, גם כאן המתינו יומיים ובדקו שלא נוצרה תגובה כלשהי. חלב פרה ניגר אינו מומלץ עד גיל שנה, זאת למרות שניתן לחשוף את התינוק למזונות חלביים אחרים כמו יוגורט, כבר בגיל חצישנה. בנוסף לכל אלו, יתכן שגם חלב האם מעניק לתינוק הגנה מסוימת, מפני התפתחות של אלרגיה למזון. לכן, כדאי להמשיך להניק את התינוק עד כמה שניתן, בעיקר אם ישנה היסטוריה משפחתית של אלרגיה למזון.'

	),
];

export const TIPS = [
	new TipTitem(
		't1',
		'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/ad-kama-toremet-images_a2_725x418.webp?itok=ewbTSRrU',
		'מזונות על והערכים שלהם!',
		' בואו לגלות אילו סוגי מזונות מומלץ להגיש לתינוק שלכם!',
		[
			{ id: '1', title: 'בננות', itemData: 'בננות עשירות בפחמימות, שמספקות אנרגיה וסיבים, המסייעים לשמי על מערכת עיכול בריאה. מדובר במזון שמתאים במיוחד ליציאה מהבית, מאחר והקליפה שומרת על הפרי וניתן לקלף אותה בקלות. כאשר אתם מגישים בננות לתינוקות צעירים, וודאו כי היא כבר בשלה לחלוטין ומעכו אותה היטב. תינוקות גדולם יותר יכולים לאכול אותה בחתיכות קטנות כ"מזון אצבעות", אבל גם אז חשוב להקפיד שהפרי בשל עלמנת שיהיה להם קל ללעוס ולעכל' },
			{ id: '2', title: 'ביצים', itemData: 'ביצים הן מאכל שמלא בדברים טובים לגוף. החלבון מכיל בעיקר פרוטאין ואילו החלמון מספק לגוף אבץ וויטמינים מסוג A, D, E ו-B12. בנוסף מכל החלבון כולין, חומר שהוכח במחקרים כנחוץ להתפתחות בריאה של המוח. באופן מסורתי אנשי מקצוע המליצו לרופאים בעבר שלא להאכיל תינוקות בביצים, בעיקר בחלבון הביצה, עד גל שנה בגלל החשש מפני אלרגיות. אבל בשנים האחרונות ישנם יותר ויותר מומחים שגורסים שצריך לנהוג כך רק בקרב משפחות שיש להן היסטוריה של אלרגיות. כיוון שביצים הן אחד המקורות הטובים לפרוטאין וערכים תזונתיים חשובים נוספים, מומלץ להתייעץ עם רופא הילדים כאשר התינוק מתחיל לאכול מזון מוצק ולראות מה ההמלצה לגביכם.' },
			{ id: '3', title: 'אבוקדו', itemData: 'אבוקדו נחשב בטעות לירק, אבל למעשה מדובר בפרי. הוא מכיל יותר חומרים מזינים מכל מזון אחר בקבוצה ה הוא נמצא. יש לו את רמות הפרוטאין הגבוהות ביותר מכל הפירות והוא עשיר בשומן בלתי רווי - השומן ה"טוב" שעוזר במניעת מחלות לב. גם כאן חשוב לוודא שאתם מגישים לתינוק אך ורק אבוקדו בשל. שטפו את הקליפה החיצונית, קלפו אותה ואז מעכו את "בשר" האבוקדו היטב. כיוון שמדובר במאכל עשיר בשומן, ייתכן שהתינוק שלכם יחוש שבע מהר יותר, לכן מומלץ להגיש אותו במנות קטנות יחסית לצד מזונות אחרים.' },
			{ id: '4', title: 'גזר', itemData: 'בגזר יש כמות גדולה מאוד של בטא-קרוטן, אנטי-אוקסידנט שמעניק לו את צבעו הכתום. בטא-קרוטן הופך לויטמין A בגוף והוא חשוב מאוד לתהליך הגדילה ולראייה תקינה. בישול גזר מוציא את הטעם המתוק הטבעי שלו, מה שהופך אותו למושך מאוד עבור תינוקות, שנולדים עם משיכה למתוק. כאשר אתם בשלים גזר לקטנים שלכם וודאו שהוא מבושל היטב, עד שהוא מאוד-מאוד רך. לאחר מכן רסקו אותו או, אם התינוק שלכם כבר גדול מספיק בשביל "אוכל אצבעות", חתכו אותו לקוביות קטנות' },
			{ id: '5', title: 'יוגורט', itemData: 'יוגורט מעניק לתינוק שלכם סידן, פרוטאין וזרחן, שחשובים לעצמות ולשיניים חזקות ובריאות. ביוגורט ישנם גם חיידקים פורביוטיים, חיידקים "טובים" שמסייעים לעיכול ותומכים במערכת החיסונית. חשוב לבחור ביוגורט מחלב מלא, ולא דל-שומן, כיוון שתינוקות זקוקים לשומן בתזונה שלהם. בנוסף מומלץ להימנע מיוגורט בטעמים, כיוון שהם מכילים רמות גבוהות של סוכר. אם אתם רוצים לתת ליוגורט טעם נוסף, אתם יכולים להוסיף מעט מחית פירות. חשוב לדעת כי תינוקות בני פחות משנה עלולים לפתח תגובה אלרגית לפרוטאין שבחלב, ממנו עשוי היוגורט, ולכן כדאי גם במקרה הזה להתייעץ עם רופא הילדים לפי שמגישים אותו לתינוק בפעם הראשונה.' },
			{ id: '6', title: 'גבינה צהובה', itemData: 'גבינה צהובה גם היא מקור טוב לפרוטאין, החשוב כל כך לגדילה, ומכילה גם סידן, החשוב כל כך לשמירה על עצמות ושיניים חזקות. בנוסף היא מכילה כמות בריאה של ריבופלבין (ויטמין B2), שמסייע להפוך את הפרוטאין, השומן והפחמימות לאנרגיה. כיוון שגבינה צהובה עלולה לגרום לחנק, חשוב לחתוך אותה לחתיכות קטנות מאוד. היא טובה במיוחד לתינוקות קצת יותר גדולים, שכבר יכוליםלאכול "אוכל אצבעות" ורגילים לטקסטורות שונות' },
			{ id: '7', title: 'עוף', itemData: 'עוף הוא מקור חשוב לפרוטאין ולויטמין B6 שמסייע לגוף להפוך את המזון לאנרגיה. חשוב שתינוקות יאכלו בקביעות מזונות המכילים כמות מספקת של פרוטאין, שתתמוך בגדילה המואצת שלהם. אם התינוק שלכם אינו אוהב את הטעם של העוף, ניתן לערב אותו יחד עפ פירות/ירקות שהטעם שלהם מועדף על ילדים. ' },
			{ id: '8', title: 'בשר אדום', itemData: 'בשר אדום מספק לגוף ברזל בצורה שנספגת בקלות רבה יותר, ולכן הוא חשוב מאוד לתינוק. הברזל מסייע לתאי הדם האדומים להעביר חמצן לתאי הגוף השונים והוא חשוב מאוד להתפתחות המוח. למרבה הצער, מחסור בברזל, שעלול לגרום לאורך זמן בעיות התנהגות וריכוז, הוא אחת הבעיות הנפוצות בילדים. לכן חשוב לוודא שהתינוק שלכם מקבל כמות מספקת של ברזל בתזונה שלו, מבשר אדום וממקורות נוספים. לתינוקת קטנים ניתן להגיש מחית של בשר אדום וירקות. תינוקות גדולים יותר, שכבר מסוגלים ללעוס, יכולים לאכול קוביות קטנות של בשר מבושל' },
			{ id: '9', title: 'דלורית', itemData: 'דלורית מאוד אהובה על תינוקות, כיוון שהיא בעלת טעם מתקתק. היא מקור טוב לבטא-קרוטן, ויטמין C, אשלגן, סיבים תזונתיים, ויטמינים מקבוצת B ואפילו מעט חומצות שומן מסוג אומגה 3. מאוד קל להכין בבית דלורית. פשוט אדו או הרתיחו אותה עד שהיא רכה, ואז מעכו אותה למחית רכה. מומלץ להכין כמות גדולה, כיוון שלרוב לא רק התינוק יאכל ממנה, אלא כל בני המשפחה.' },
			{ id: '10', title: 'דגים', itemData: 'דגים הם מקור מצויין לפרוטאין, שכאמור חשוב לגדילה תקינה של תינוקות. דגים שומניים, כמו סלמון, מספקים ויטמינים מסיסים בשומן, כמו גם שומנים חיוניים כמו DHA, שחשובים להתפתחות המוח והעיניים ולמערכת חיסון בריאה. דגים עלולים לגרום לאלרגיות, לכן חשוב לשוחח עם רופא הילדים לפני שמוסיפים אותם לתפריט התינוק. ברגע שקיבלתם את האו.קיי ההמלצה היא לתת לתינוק שתי מנות דגים בשבוע, כשחשוב להקפיד שהם יהיו בעלי רמות כספית נמוכות.' },
			{ id: '11', title: 'עגבניות', itemData: 'עגבניות עשירות בליקופן, הפיגמנט האדום נמצא בהן ומתפקד כאנטיאוקסידנט שעוזר למנוע סרטן ומחלות לב. הליקופן יכול להיספג בגוף בצורה יעילה יותר אם העגבניות בושלו קודם לכן עם שמן. לכן מומלץ להכין רוטב עגבניות לפסטה על ידי בישול העגבניות עם מעט שמן זית. רסקו את הרוטב היטב עבור האכלנים המתחילים.' },
			{ id: '12', title: 'אפונה', itemData: 'אפונה "מתפוצצת" מויטמין  K ויטמין שלצד סידן מסייע לבניית עצמות בריאות.אפונה היא גם מקור טוב לאנטיאוקסידנטים כמו גם לחומצה פולית וויטמינים מקבוצה A,B,C. הוספת אפונה לצלחת של תינוקכם תהווה עבורו מקור מצויין לסיבים, שמחקרים הראו כי מרבית התינוקות לא אוכלים כמות מספקת של סיבים. מחית של אפונה היא דבר פשוט מאוד לכנה - ובעל טעם נהדר ואהוב מאוד על תינוקות. ' },
			{ id: '13', title: 'ברוקולי', itemData: 'ברוקולי הוא מזון-על של ממש, כיוון שהוא מהווה מקור טוב לויטמין C ומכיל גם בטא-קרוטן, חומצה פולית, סידן וסיבים. בישול ברוקולי במים מוריד את כמות הויטמין C לחצי, לכן עדיף לבשל אותו באדים או במיקרוגל. אם התינוק שלכם לא "משתגע" על הטעם של הברוקולי, ערבבו אותו עם ירקות בעלי טעם מתקתק כמו בטטה או דלוריות.' },
			{ id: '14', title: 'פירות הדר', itemData: 'פירות הדר, הכוללים בין היתר תפוזים, לימונים ואשכוליות, הם מקור נהדר לויטמין C שעוזר לבנות את הקולגן. ויטמין C גם מסייע לריפוי של פצעים ועוזר לספיגה של ברזל מהמזון שבשרירים, ביצמות וברקמות גוף אחרות. פירות הדר מכילים גם אשלגן, מינרל שמסייע לפעולת השרירים ובעל תפקיד חשוב לשמירה על מאזן הנוזלים בגוף לעתים פירות הדר עלולים להיות חומצתיים מדי עבור תינוקות, ולכן מומלץ להמתין ולהגיש אותם רק אחרי גיל שנה.' },
			{ id: '15', title: 'בטטות', itemData: 'בטטות הן מקור מצויין לאשלגן, ויטמין C וסיבים ומקור מעולה לבטא-קרוטן, אנטי-אוקסידנט שמסייע במניעת סןגים שונים של סרטן ומנקה את הגוף מרדיקלים חופשיים. רוב התינוקות יעדיפו בטטות על פני ירקות אחרים, כיוון שיש להן טעם מתוק באופן טבעי. כשהם מבושלות ומעוכות הבטטות הופכות לעיסה חלקה שקל לתינוקות לאכול, אפילו כאלו שרק עושים את צעדיהם הראונים בתחום המוצקים ' },
			{ id: '16', title: 'פסטה', itemData: 'פסטה עשירה בפחמימות, שהן ספק האנרגיה החשובים של הגוף. הטעם העדין והצורות הכייפיות גורמות לכך שהפסטה היא מאכל מושך - בכל הגילאים. רוב הפסטות מועשרות בויטמינים ומינרלים, כמו חומצה פולית, ברזל וויטמינים מקבוצה B. פסטה מחיטה מלאה מספקת גם סיבים תזונתיים, אך המרקם שלה עלול להיות קשה מדי עבור תינוקות רכים. פסטה בצורות קטנות, שמבושלת עד שהיא רכה מאוד, יכולה להיות מזון אצבעות מעולה לתינוקות גדולים יותר ולפעוטות.' },
		],
	),
];