import { Category } from './src/models/category';
import Meal from './src/models/meal';
import Article from './src/models/article';
import TipTitem from './src/models/tipItem';

export const CATEGORIES = [
    new Category('c1', 'מתכונים לבוקר', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_bnnh_tpvkh_vshybvlt_shvl.webp?itok=2HnBvYLF'),
    new Category('c2', 'מתכונים לצהריים', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_vp_m_yrqvt_vtryvt.webp?itok=GLsxSVvl'),
    new Category('c3', 'מתכונים לערב', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qrt_dyyst_dgnym.webp?itok=abfxDz3Q'),
    new Category('c4', ' כל המתכונים ', '#FAFAFA', 'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qrt_dyyst_dgnym.webp?itok=abfxDz3Q'),
];


export const MEALS = [
    new Meal(
        'm1',
        ['c1', 'c3', 'c4'],
        ' יוגורט עם בננה, תפוח ושיבולת שועל',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_bnnh_tpvkh_vshybvlt_shvl.webp?itok=2HnBvYLF',

        10,
        [
            'יוגורט 1',
            '1 בננה',
            '1 תפוח',
            'שיבולת שועל',
            'סילאן',

        ],
        [
            'חותכים את הבננה והתפוח לחתיכות, מכניסים לקערית עם יוגורט',
            'מוסיפים מעט פתיתי שיבולת שועל ומערבבים. יוצקים מעל סילאן [לא חובה] ומגישים',
        ],
        false,
        false,
        false,
        true,
        false,
        true
    ),

    new Meal(
        'm2',
        ['c1', 'c3', 'c4'],
        'פרנץ טוסט',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/prnts_tvst.webp?itok=JQT9oDKP',
        15,
        [
            '1 פרוסת חלה',
            'ביצה',
            'מעט חלב',
            'שמן לטיגון'
        ],
        [
            'טורפים ביצה עם מעט חלב',
            'טובלים את הפרוסה  משני הצדדים בבלילה ומניחים במחבת שחומם מראש עם מעט שמן',
            'ממתינים  כ-2 דקות או עד שמשחים והופכים לצד השני',
            'ניתן להגיש לצד גבינה לבנה ופירות חתוכים'
        ],
        false,
        false,
        false,
        true,
        false,
        false
    ),

    new Meal(
        'm3',
        ['c1', 'c4'],
        'פנקייק תפוח עץ מוגש עם גבינה לבנה וממרח חמאת בוטנים',
        'קל-בינוני',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/pnqyyq_tpvkhym.webp?itok=KnFkmIaP',
        20,
        [
            '1/2 כוס קמח לבן',
            '1/2 כוס קמח מלא',
            '1 צנצנת מחית תפוחי עץ  גרבר',
            '1 כוס חלב',
            '2 ביצים'
        ],
        [
            'מערבבים את החומרים היטב עד לקבלת בלילה אחידה',
            'מחממים מחבת טפלון ומשמנים קלות במעט שמן',
            'בעזרת מצקת יוצקים מהבלילה למחבת החמה, הופכים לאחר כדקה עד שתיים עד לקבלת פנקייקס זהובים',
            'ניתן להגיש לצד כף גבינה לבנה וכף חמאת בוטנים',
            'פנקייק היא דרך נהדרת לשלב חלבון וסידן בתפריט'
        ],
        false,
        false,
        false,
        true,
        false,
        false
    ),
    new Meal(
        'm4',
        ['c2', 'c4'],
        'מרק ירקות, קוסקוס ועוף',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_yrqvt_qvsqvs_vvp.webp?itok=94PoOm6E',
        60,
        [
            'קוסקוס',
            '1 בצל',
            '1 גזר',
            '1 תפוח אדמה',
            '1 דלעת',
            'גבעולי סלרי',
            'פטרוזילה',
            'שמיר',
            ' כרעיים עוף מחולק',
            '4 כוסות מים',
            'תבלינים כגון כורכום ופלפל שחור',
        ],
        [
            ' מכינים את הקוסקוס לפי הוראות היצרן. חותכים את הירקות לקוביות',
            'מכניסים את כל החומרים לסיר ומביאים להרתחה',
            'מעבירים לאש נמוכה לעוד כשעה',
            'מוסיפים תבלינים לפי הטעם',
            'מוסיפים למרק את הקוסקוס, בתאבון!',
            'ותרו על המלח ואבקות המרק, השתמשו בעשבי תיבול טבעיים כמו סלרי, פטרוזיליה, כוסברה ושום.'

        ],
        false,
        false,
        false,
        true,
        true,
        true
    ),


    new Meal(
        'm5',
        ['c2', 'c4'],
        'מרק אפונה',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_pvnh.webp?itok=SFzASqEK',
        45,
        [
            '1 בצל',
            '1 גזר',
            '1 תפוח אדמה',
            ' 1 קישוא',
            '1 כוס אפונה ירוקה קפואה',
            ' 1 שוק הודו נקבה(ללא עור)',
            ' או 200 גרם שווארמה הודו חתוכה לקוביות',
            '4 כוסות מים',
            '  עשבי תיבול - סלרי, פטרוזילה, כוסברה',
        ],
        [
            'מחממים את השמן בסיר, קוצצים את הבצל ומשחימים',
            'מוסיפים את הבשר ומערבבים היטב',
            'מוסיפים את הירקות, האפונה ועשבי התיבול  למים ומביאים לרתיחה',
            'מבשלים על להבה בינונית במשך ½ שעה',
            'במידה ושמים שוק הודו, מפרקים מהעצמות וטוחנים למרקם חלק',
            'ניתן לשלב עשבי תיבול, בצל ושום להעשרת הטעם',
            'בהמשך ניתן לשלב תבלינים כמו כורכום, פפריקה, כמון',
            'מומלץ לוותר על מלח ואבקות מרק',
        ],
        false,
        false,
        false,
        true,
        false,
        true
    ),
    new Meal(
        'm6',
        ['c3', 'c4'],
        'מאפינס תירס ירקות חתוכים וקוטג',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mpyns_tyrs.webp?itok=3zdJJDjX',
        50,
        [
            'חצי קופסת תירס',
            "2 גזרים",
            '1 ביצה',
            '1 כף גדושה קמח תופח',
            'פרמזן מגורד (לפי הטעם)',
            ' פלפל',
            ' תבנית מאפינס מסיליקון',
            'קוטג',
            'גמבה עגבניה ומלפפונים חתוכים',
        ],
        [
            'מגרדים את הירקות בפומפייה ומערבבים בקערה את כל החומרים',
            'יוצקים לתבנית את התערובת לתבנית שקעים אך לא עד הקצה',
            'כניסים לתנור שחומם מראש ל 180 מעלות ואופים 40-30 דקות',
            'מגישים עם ירקות חתוכים וקוטג',
        ],
        false,
        false,
        false,
        true,
        false,
        false
    ),
    new Meal(
        'm7',
        ['c3', 'c4'],
        'לביבות ירק שילדים אוהבים',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/lbybvt_yrq_m_shmnt_vbvqdv.webp?itok=fz3IohzK',
        30,
        [
            '1 גזר',
            " 1 קישוא",
            '1 תפוח אדמה',
            '3 כפות קמח',
            '2 ביצים',
            ' פלפל',
        ],
        [
            ' מגרדים בפומפייה את הירקות',
            'מערבבים את כל החומרים ומטגנים במחבת עם מעט שמן',
            'ניתן להגיש שמנת חמוצה ואבוקדו',
            'בתאבון!',
        ],
        false,
        true,
        false,
        true,
        true,
        false
    ),

    new Meal(
        'm8',
        ['c2', 'c4'],
        'קציצות בקר עם אפונת גינה',
        'קל-בינוני',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/qtsytsvt_m_pvnh.webp?itok=U3Nb1owh',
        35,
        [
            'לתערובת הקציצות:',
            '1/2 ק"ג בשר בקר טחון',
            "1 גזר מגורר",
            '1 קישוא מגורר',
            '1 תפוח אדמה מגורר',
            ' בצל מגורר 1 ',
            'צרור פטרוזיליה',
            '1 כף שמן זית',
            '2 כפות פירורי לחם',
            '1 ביצה',
            'קורט פלפל שחור',
            '',
            'לרוטב:',
            'כף שמן זית',
            'חבילת אפונת גינה מוקפאת',
            'כורכום'
        ],
        [
            'לקציצות:',
            'מערבבים את כל החומרים בקערה ויוצרים קציצות',
            'שמים במחבת רחבה עם מכסה מעט שמן זית מוסיפים כורכום וכוס מים ומביאים לרתיחה',
            'מכניסים את הקציצות לרוטב ומוסיפים את אפונת הגינה לאחר כרבע שעה',
            'מבשלים  כ-10 דקות נוספות על אש קטנה. להגיש לצד אורז'
        ],
        false,
        false,
        false,
        true,
        true,
        false
    ),
    new Meal(
        'm9',
        ['c2', 'c4'],
        'מרק עוף עם ירקות ואטריות',
        'קל-בינוני',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_vp_m_yrqvt_vtryvt.webp?itok=GLsxSVvl',
        35,
        [
            ' קוסקוס או אטריות',
            '1 גזר',
            '1 תפו"א',
            ' גבעולי סלרי',
            '1 בצל',
            '1 דלעת ',
            'כרעיים עוף מחולק',
            'פטרוזיליה',
            'שמיר',
            '4 כוסות מים'
        ],
        [
            'מכינים בנפרד את הקוסקוס או האיטריות לפי הוראות היצרן ',
            'חותכים את הירקות לקוביות',
            'כניסים את כל החומרים לסיר ומביאים להרתחה. מעבירים לאש נמוכה לעוד כשעה',
            'להוסיף את האטריות או הקוסקוס למרק המוכן. מוסיפים תבלינים לפי הצורך',
            'הקפידו על ארוחות משפחתיות גם במהלך ימות השבוע כדי להקנות הרגלי תזונה בריאים',

        ],
        false,
        false,
        false,
        true,
        true,
        true
    ),
    new Meal(
        'm10',
        ['c2', 'c4'],
        'מרק כתום',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mrq_ktvm_0.webp?itok=z3jb7LtZ',
        45,
        [
            '1 בצל בינוני',
            '1 שן שום כתושה(לא חובה)',
            '3 גזרים',
            '1 בטטה',
            ' כוס עדשים כתומות',
            ' 6 כוסות מים',
        ],
        [
            'מחממים מעט שמן זית בסיר גדול ומטגנים את הבצל עד שהוא מזהיב',
            'מוסיפים את השום ומטגנים עוד דקה',
            'מוסיפים את הבטטה והגזרים ומאדים 5-10 דקות תוך כדי ערבוב',
            'מוסיפים את העדשים והמים ומביאים לרתיחה',

            'מנמיכים את הלהבה ומבשלים בבעבוע עדין כ-30 דקות, עד שהעדשים מתפוררות והגזר והבטטה רכים לחלוטין',
            'טוחנים את המרק למרקם חלק ואחיד',
        ],
        true,
        true,
        true,
        true,
        true,
        true
    ),
    new Meal(
        'm11',
        ['c1', 'c4'],
        'יוגורט עם פירות וממרח שקדים טבעי ',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/yvgvrt_m_pyrvt_vmmrkh_shqdym_tby.webp?itok=5KLfZU3u',
        10,
        [
            'יוגורט לא ממותק',
            'בננה',
            'תפוח',
            'ממרח שקדים טבעי'
        ],
        [
            'מרסקים את התפוח המקולף בפומפיה גסה',
            'חותכים בננה לקוביות קטנות מוסיפים לקערה עם יוגורט וכפית ממרח שקדים ומערבבים',
            'יוגורט הוא מקור טוב לחלבון, ויטמינים מקבוצה B, עשיר בסידן ובפרוביוטיקה (חיידקים ידידותיים למערכת העיכול).'
        ],
        false,
        false,
        true,
        true,
        false,
        true
    ),

    new Meal(
        'm12',
        ['c1', 'c4'],
        'מחית אגס, בננה, סלק וממרח שקדים טבעי',
        'קל',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/mkhyt_gs_bnnh_slq.webp?itok=Ffgkr7sz',
        10,
        [
            'אגס',
            'בננה',
            ' קוביית סלק לאחר אידוי',
            ' כפית ממרח שקדים טבעי'
        ],
        [
            'חותכים  ומרסקים את החומרים בבלנדר ובתיאבון!',
            'הסלק הוא מקור מעולה לברזל ולויטמין C הידועים כחיוניים לתפקוד תקין של גופנו. '
        ],
        true,
        true,
        true,
        true,
        true,
        true
    ),


]

export const ARTICLES = [
    new Article(
        'a1',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/lomdim-lechol_a_725x418.webp?itok=7QqZU8vV',
        'לומדים לאכול – השלב הבא',
        'כיצד נכון ללמד את התינוק לאכול מכפית, מדוע זמן איכות והאכלה קשובה חשובים כל כך ומהם הסימנים שמגלים לנו שהתינוק שלנו כבר שבע?',
        ' מיומנות אכילה בכפית כשלומדים לאכול, יוצאים לדרך מפותלת ומלאה במזון המקשט את בגדיו של התינוק – ולעתים גם את שלך. שרירי הפה של תינוקך מתחזקים, הוא מפתח תיאום יד-פה ומודעותו למתרחש בזמן הארוחה גוברת. בקרוב, ועם מעט עזרה, הוא יאכל לבד.אבל לפני כן, עליו ללמוד כיצד להעביר את האוכל בהצלחה מהכפית אל הפה. עבור תינוקך, ארוחות הן פעילות מהנה והוא ירצה להיות חלק מהחוויה כשיראה אותך אוכלת. ברגע שהקטן יבין מהי כפית, הוא יפתח את הפה כשיראה אותה. יכול להיות שירצה להחזיק אותה, לשחק בה או להכניס אותה לפה – וזה מצוין. התעסקות עם הכפית בכל צורה שהיא תסייע לתינוקך כשיגדל ותלמד אותו להשתמש בכלים נוספים כמו צבעים, עפרונות ומספריים.התינוק יתחיל לזהות מאכלים ואף את כלי האוכל שלו, ולכן כדאי למצוא שגרה שתתאים לשניכם ותקל על ההסתגלות לדברים החדשים.'
    ),
    new Article(
        'a2',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/1000x320.webp?itok=IG1hYr9D',
        ' פרוביוטיקה: החיידקים הטובים של המעי',
        'למה פרוביוטיקה חשובה בתזונת תינוקות?',
        'פרוביוטיקה - אשר פירושה המילולי הוא "עבור החיים" – הוא מונח המתייחס לאוכלוסיית חיידקים חיים אשר הינם בעלי יתרונות בריאותיים ספציפיים לגוף האדם, כאשר נצרכים בכמות מתאימה 99% מן החיידקים הנמצאים במעי הם למעשה בלתי מזיקים וחיוניים לבריאות. ועדיין, למרות שהם מהווים רוב מוחץ כל כך, חיידקים טובים אלה זקוקים לעתים למעט עזרה כדי לשמור על האיזון הנכון ולמנוע נזק של החיידקים הפתוגנים – מחוללי המחלות, המהווים 1%. מה היתרונות של פרוביוטיקה לילדים? פרט לתמיכה בבריאות הכוללת והגנה חיסונית, פרוביוטיקה כגון L.reuteri הוכחה באופן קליני כבעלת תועלות במערכת העיכול של תינוקות וילדים'

    ),
    new Article(
        'a3',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/tzmvn.webp?itok=wUE9Gk_b',
        ' מתי כדאי להציע לתינוק חיטה, ביצים או אגוזים?',
        'כדאי לדעת! הזמן לחשוף את התינוק לחיטה, ביצים, דגים ובוטנים אינה שונה מהזמן שבו תכננתם לחשוף לשאר המ זונות. חשיפה של התינוק למאכלים אלו מוקדם, החל מגיל חצי שנה, עשויה להפחית את הסיכון לאלרגיה למזונות אלו החשודים כאלרגנים.',
        'אלרגיה למזון, שכיחה יותר בילדים, מאשר במבוגרים. שכיחות האלרגיה למזון בקרב תינוקות וילדים מוערכת ב-%8%-2. במשך שנים רבות, ההמלצה היתה לדחות חשיפה למזונות המזוהים בדרך כלל כאלרגניים (כמו: סויה, חיטה, ביצים, דגים, אגוזים, רכיכות, מוצרי חלב ובוטנים). לגבי חלק מהמזונות, ההמלצה היתה לחכות אפילו לגיל שנתיים או שלוש. עם זאת, מחקרים מהשנים האחרונות מצאו שדחיית זמן החשיפה של מזונות אלו, לא הוכחה כיעילה בהפחתת אלרגיה אצל תינוקות. בשנים האחרונות, ההמלצות השתנו ומדענים גילו, שכאשר התינוק בריא ובשל מבחינה התפתחותית, אין כל סיבה להמתין כדי להציע לו את המאכלים האלו, בזמן המעבר למזון משלים. מחקרים מראים, שדחיית מתן מזונות אלרגניים לתינוקות, מעבר לגיל 6-10 חודשים, עלולה אף להעלות את הסיכון לאלרגיה למזון. מחקרים אלו הציעו, שחשיפת תינוקות למזונות אלו מוקדם יחסית, באופן קבוע ובמנות קטנות, עשויה לתרום לסבילות של מערכת החיסון, כלפי חלק מהמזונות ועשויה למנוע אלרגיה למזון. אם לתינוקכם יש אקזמה, היסטוריה משפחתית של אלרגיה או כל מקרה ספציפי של אלרגיה למזון, התייעצו עם הרופא/ה המטפל/ת לפני שאתם חושפים אותו למזון שעלול לעורר תגובה אלרגית. הציעו לקטנטן שלכם טעימה ראשונה מאחד מהמזונות הללו ואז המתינו יומיים. חשוב לבודד את המזון האלרגני, כדי שניתן יהיה לבדוק האם נוצרה תגובה אלרגית כלשהי. לאחר שתוודאו שלא נוצרה תגובה אלרגית, תוכלו להציע טעימה ממזון אלרגני אחר, גם כאן המתינו יומיים ובדקו שלא נוצרה תגובה כלשהי. חלב פרה ניגר אינו מומלץ עד גיל שנה, זאת למרות שניתן לחשוף את התינוק למזונות חלביים אחרים כמו יוגורט, כבר בגיל חצישנה. בנוסף לכל אלו, יתכן שגם חלב האם מעניק לתינוק הגנה מסוימת, מפני התפתחות של אלרגיה למזון. לכן, כדאי להמשיך להניק את התינוק עד כמה שניתן, בעיקר אם ישנה היסטוריה משפחתית של אלרגיה למזון.'

    ),
];

export const TIPS = [
    new TipTitem(
        't1',
        'https://www.nestlebabyandme.co.il/sites/default/files/styles/content_media_desktop/public/content_image/ad-kama-toremet-images_a2_725x418.webp?itok=ewbTSRrU',
        'סוגי מזונות מומלצים לתינוק',
        'התחלתם עם התינוק מזון מוצק? בואו לגלות אילו סוגי מזונות מומלץ להגיש לתינוק שלכם!',
        'מומלץ לבחור במזונות עשירים בברזל כמאכלים ראשונים, לדוגמה: בשר בקר, הודו, דגים, קטניות, דגנים לתינוקות מועשרים בברזל ועוד.                                                                              התחילו עם ירקות, ובהדרגה תוכלו לשלב מרכיב חלבוני כמו עוף, הודו, קטניות, דג  עד ביסוס ארוחה מזינה.                               וותרו על  השימוש במלח ואבקות מרק. ניתן להשתמש בעשבי תיבול כמו פטרוזליה, כוסברה, שורש סלרי, בצל שום ועוד.                                     חשיפה לפירות תתחיל בהדרגה עד לביסוס ארוחה המכילה שלל פירות מגוונים וצבעוניים.ניתן להוסיף רכיב שומני בריא כמו טחינה גולמית, או אבוקדו.                                                 מחיות גרבר בצנצנות ובפאוצים יכולות להוות פתרון נהדר ונוח מאוד לשימוש כשיוצאים מהבית - עשויות מפירות וירקות  המגיעים משדות ייעודיים לגידול מזון תינוקות, ללא חומרי טעם וריח וללא חומרים משמרים.                                                         ניתן לשלב מוצרי חלב לא ממותקים בתפריט התינוק כמו גבינות, לבן, יוגורט לא ממותק ועוד.                                                                                                                           שימו לב שמוצרי חלב דלים בברזל לכן עדיף להציע אותם בכמות קטנה ומגיל 9 חודשים, עם הוספת ארוחת מוצקים שלישית, ניתן לשלבם כחלק מהגיון התזונתי הניתן בארוחה  חלב מפוסטר 3 % ודבש יינתנו לתינוק רק לאחר גיל שנה '
    ),
];