export const aboutUsDefaultValue = {
	one: '.מתי בפעם האחרונה רצית להכין ארוחה מזינה וטעימה לתינוקך אך לא באמת ידעת איזה מאכל יכיל את מיטב מרכיבי המזון הנצרכים בדיוק בשבילו? סביר להניח שהנך נתקל בזה מדי יום',
	two: 'כמה אהבה משקיעה האם בהכנת האוכל לתינוקה? באיזו צפייה ודריכות מתבוננים ההורים בילדם בזמן האכילה, האם ייהנה ויאכל לשמחתם, או ידחה את הארוחה למגינת ליבם?',
	three: 'חשיבות רבה מלווה ברגש רב מייחסים ההורים לתזונה של ילדיהם,  ולא בכדי: תזונה, יודע כל הורה, היא דבר חשוב. אך אצל פעוטות החשיבות עולה עוד יותר.',
	four: 'האפליקציה מבוססת על העובדה שישנם מזונות שיעשו את העבודה טוב יותר מאחרים. עם זאת, יש לשמור על כללי הזנה נכונים, בעיקר בשלבי חייו הראשונים של התינוק ,להימנע מחשיפתו המוקדמת למוצרי מזון יוצרי אלרגיה, כאלה שמערכת העיכול עדיין אינה בשלה עבורם, וכמובן להיזהר מחשיפה למוצקים העלולים- אם הם מוגשים בשלב מוקדם מידי-לגרום לסכנת חיים',
	five: 'האפליקציה נועדה לתת כלים ומידע להורים צעירים ומנוסים כאחד הרוצים להאכיל את התינוקות שלהם במזון המזין והטוב ביותר החל מהביס הראשון. המערכת מותאמת החל מגיל חצי שנה בו מומלץ להתחיל בשלב הטעימות על פי המלצת משרד הבריאות, ועד לגיל שנה וחצי.',
} 